package com.example.mifans.eif.other;

import java.util.ArrayList;
import java.util.Arrays;
import java.util.List;
import java.util.regex.Matcher;
import java.util.regex.Pattern;

/**
 * 歌词解析类
 */
public class ParsingLyric {
    private static List<String> wordslist;//存放歌词
    private List<Integer> timelist = new ArrayList<>();//存放时间
    private String lyric;//歌词源文件

    public ParsingLyric(String lyric) {
        this.lyric = lyric;
    }
    public static void parsin(String test){
        wordslist = Arrays.asList(test.split("\\[\\d{2}:\\d{2}[\\.:]\\d{3}?\\]"));
        String regex1 = "\\[.+\\]";
        System.out.println(wordslist.get(0).matches(regex1));
//        for (int i = 0; i < 5; i++) {
//
//        }
//        String regex = "\\[\\d{2}:\\d{2}[\\.:]\\d{3}?\\]";
//        Pattern pattern = Pattern.compile(regex);
//        Matcher matcher = pattern.matcher(test);
//        while (matcher.find()){
//            wordslist.add(matcher.group());
//        }
    }

    public static void main(String[] args) {
        parsin("[ti:ハロ ハワユ]\n" +
                "    [ar:鹿乃]\n" +
                "    [00:12.395]ハロ窓を开けて小さく呟いた\n" +
                "    [00:17.393]ハワユ谁もいない部屋で一人\n" +
                "    [00:22.391]モーニン朝が来たよ土砂降りの朝が\n" +
                "    [00:28.303]チックタク私のネジを谁か巻いて\n" +
                "    [00:56.303]ハロ昔のアニメにそんなのいたっけな\n" +
                "    [01:00.397]ハワユ羡ましいな皆に爱されて\n" +
                "    [01:05.365]スリーピン马鹿な事言ってないで支度をしなくちゃ\n" +
                "    [01:10.389]クライン涙の迹を隠す为\n" +
                "    [01:15.362]もう\n" +
                "    [01:16.368]口癖になった「まぁいっか」\n" +
                "    [01:19.322]昨日の言叶がふと头を过る\n" +
                "    [01:21.371]「もう君には全然期待してないから」\n" +
                "    [01:26.379]そりゃまぁ私だって\n" +
                "    [01:29.328]自分に期待などしてないけれど\n" +
                "    [01:32.303]アレは一体どういうつもりですか\n" +
                "    [01:36.380]喉元まで出かかった言叶\n" +
                "    [01:41.393]口をついて出たのは嘘\n" +
                "    [01:46.340]こうして今日も私は贵重な\n" +
                "    [01:51.367]言叶を浪费して生きてゆく\n" +
                "    [01:56.334]何故隠してしまうのですか\n" +
                "    [01:59.324]笑われるのが怖いのですか\n" +
                "    [02:01.383]谁にも会いたくないのですか\n" +
                "    [02:04.342]それ本当ですか\n" +
                "    [02:06.382]暧昧という名の海に弱れて\n" +
                "    [02:09.357]息も出来ないほど苦しいの\n" +
                "    [02:12.311]少し声が闻きたくなりました\n" +
                "    [02:14.364]本当に弱いな\n" +
                "    [02:22.330]一向に进まない支度の途中\n" +
                "    [02:24.399]朦胧とした头で思う\n" +
                "    [02:27.342]「もう理由を付けて休んでしまおうかな」\n" +
                "    [02:32.356]いやいや分かってますって\n" +
                "    [02:35.315]何となく言ってみただけだよ\n" +
                "    [02:37.385]分かってるから怒らないでよ\n" +
                "    [02:42.363]幸せだろうと不幸せだろうと\n" +
                "    [02:47.371]平等に残酷に\n" +
                "    [02:49.395]朝日は升る\n" +
                "    [02:52.308]生きていくだけで\n" +
                "    [02:54.347]精一杯の私に\n" +
                "    [02:57.347]これ以上何を望むというの\n" +
                "    [03:02.310]何故気にしてしまうのですか\n" +
                "    [03:05.315]本当は爱されたいのですか\n" +
                "    [03:07.353]その手を离したのは谁ですか\n" +
                "    [03:10.327]気が付いてますか\n" +
                "    [03:12.310]人生にタイムカードがあるなら\n" +
                "    [03:15.305]终わりの时间は何时なんだろう\n" +
                "    [03:17.379]私が生きた分の给料は\n" +
                "    [03:20.303]谁が払うんですか\n" +
                "    [03:32.353]サンキューありがとうって言いたいの\n" +
                "    [03:37.336]サンキューありがとうって言いたいの\n" +
                "    [03:42.318]サンキュー一度だけでも良いから\n" +
                "    [03:48.323]心の底から大泣きしながらありがとうって言いたいの\n" +
                "    [03:55.363]何故隠してしまうのですか\n" +
                "    [03:58.317]本当は闻いて欲しいのですか\n" +
                "    [04:00.362]绝対に笑ったりしないから\n" +
                "    [04:02.385]话してみませんか\n" +
                "    [04:05.319]口を开かなければ分からない\n" +
                "    [04:08.324]思ってるだけでは伝わらない\n" +
                "    [04:10.372]なんて面倒くさい生き物でしょう\n" +
                "    [04:13.352]人间というのは\n" +
                "    [04:18.315]ハロハワユ\n" +
                "    [04:23.307]ハロハワユ\n" +
                "    [04:28.315]ハロハワユ\n" +
                "    [04:30.369]あなたにハロハワユ");
        System.out.println(wordslist);
        System.out.println(wordslist.get(0).matches("\\[.+\\]"));
    }
}
